TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G3519/driverlib/empty_driverlib_src/ti/driverlib/dl_timer.h
/*! @enum DL_TIMER_EVENT_ROUTE */
typedef enum {
    /*! TIMER event route 1 */
    DL_TIMER_EVENT_ROUTE_1 = 0,
    /*! TIMER event route 2 */
    DL_TIMER_EVENT_ROUTE_2 = 12
} DL_TIMER_EVENT_ROUTE;

/*! @enum DL_TIMER_INPUT_CHAN */
typedef enum {
    /*! Selected timer instance channel 0 as input capture channel */
    DL_TIMER_INPUT_CHAN_0,
    /*! Selects timer instance channel 1 as input capture channel */
    DL_TIMER_INPUT_CHAN_1,
    /*! Selects timer instance channel 2 as input capture channel.
     *  Please refer to device DS to determine number of input channels
     *  by the timer instance */
    DL_TIMER_INPUT_CHAN_2,
    /*! Selects timer instance channel 3 as input capture channel.
     *  Please refer to device DS to determine number of input channels
     *  by the timer instance */
    DL_TIMER_INPUT_CHAN_3,
} DL_TIMER_INPUT_CHAN;

/*! @enum  DL_TIMER_DEBUG_RES */
typedef enum {
    /*! Resume counting */
    DL_TIMER_DEBUG_RES_RESUME = GPTIMER_CTRCTL_DRB_RESUME,
    /*! Perform the action as specified by the Counter Value After Enable (CVAE)
     *! field. */
    DL_TIMER_DEBUG_RES_CVAE_ACTION = GPTIMER_CTRCTL_DRB_CVAE_ACTION,
} DL_TIMER_DEBUG_RES;

/*! @enum  DL_TIMER_CZC */
typedef enum {
    /*! Zero event is controlled by CCCTL0 Zero condition */
    DL_TIMER_CZC_CCCTL0_ZCOND = GPTIMER_CTRCTL_CZC_CCCTL0_ZCOND,
    /*! Zero event is controlled by CCCTL1 Zero condition */
    DL_TIMER_CZC_CCCTL1_ZCOND = GPTIMER_CTRCTL_CZC_CCCTL1_ZCOND,
    /*! Zero event is controlled by CCCTL2 Zero condition */
    DL_TIMER_CZC_CCCTL2_ZCOND = GPTIMER_CTRCTL_CZC_CCCTL2_ZCOND,
    /*! Zero event is controlled by CCCTL3 Zero condition */
    DL_TIMER_CZC_CCCTL3_ZCOND = GPTIMER_CTRCTL_CZC_CCCTL3_ZCOND,
    /*! Zero event is controlled by 2-input QEI mode */
    DL_TIMER_CZC_QEI_2INP = GPTIMER_CTRCTL_CZC_QEI_2INP,
    /*! Zero event is controlled by 3-input QEI mode */
    DL_TIMER_CZC_QEI_3INP = GPTIMER_CTRCTL_CZC_QEI_3INP,
} DL_TIMER_CZC;

/*! @enum  DL_TIMER_CAC */
typedef enum {
    /*! Advance event is controlled by CCCTL0 advance condition */
    DL_TIMER_CAC_CCCTL0_ACOND = GPTIMER_CTRCTL_CAC_CCCTL0_ACOND,
    /*! Advance event is controlled by CCCTL1 advance condition */
    DL_TIMER_CAC_CCCTL1_ACOND = GPTIMER_CTRCTL_CAC_CCCTL1_ACOND,
    /*! Advance event is controlled by CCCTL2 advance condition */
    DL_TIMER_CAC_CCCTL2_ACOND = GPTIMER_CTRCTL_CAC_CCCTL2_ACOND,
    /*! Advance event is controlled by CCCTL3 advance condition */
    DL_TIMER_CAC_CCCTL3_ACOND = GPTIMER_CTRCTL_CAC_CCCTL3_ACOND,
    /*! Advance event is controlled by 2-input QEI mode */
    DL_TIMER_CAC_QEI_2INP = GPTIMER_CTRCTL_CAC_QEI_2INP,
    /*! Advance event is controlled by 3-input QEI mode */
    DL_TIMER_CAC_QEI_3INP = GPTIMER_CTRCTL_CAC_QEI_3INP,
} DL_TIMER_CAC;

/*! @enum  DL_TIMER_CLC */
typedef enum {
    /*! Load event is controlled by CCCTL0 load condition */
    DL_TIMER_CLC_CCCTL0_LCOND = GPTIMER_CTRCTL_CLC_CCCTL0_LCOND,
    /*! Load event is controlled by CCCTL1 load condition */
    DL_TIMER_CLC_CCCTL1_LCOND = GPTIMER_CTRCTL_CLC_CCCTL1_LCOND,
    /*! Load event is controlled by CCCTL2 load condition */
    DL_TIMER_CLC_CCCTL2_LCOND = GPTIMER_CTRCTL_CLC_CCCTL2_LCOND,
    /*! Load event is controlled by CCCTL3 load condition */
    DL_TIMER_CLC_CCCTL3_LCOND = GPTIMER_CTRCTL_CLC_CCCTL3_LCOND,
    /*! Load event is controlled by 2-input QEI mode */
    DL_TIMER_CLC_QEI_2INP = GPTIMER_CTRCTL_CLC_QEI_2INP,
    /*! Load event is controlled by 3-input QEI mode */
    DL_TIMER_CLC_QEI_3INP = GPTIMER_CTRCTL_CLC_QEI_3INP,
} DL_TIMER_CLC;

/*! @enum  DL_TIMER_COUNT_AFTER_EN */
typedef enum {
    /*! The counter is set to the LOAD register value */
    DL_TIMER_COUNT_AFTER_EN_LOAD_VAL = GPTIMER_CTRCTL_CVAE_LDVAL,
    /*! The counter value is unchanged from its current value */
    DL_TIMER_COUNT_AFTER_EN_NO_CHANGE = GPTIMER_CTRCTL_CVAE_NOCHANGE,
    /*! The counter is set to zero */
    DL_TIMER_COUNT_AFTER_EN_ZERO = GPTIMER_CTRCTL_CVAE_ZEROVAL,

} DL_TIMER_COUNT_AFTER_EN;

/*! @enum  DL_TIMER_REPEAT_MODE */
typedef enum {
    /*! Does not automatically advance following a zero event */
    DL_TIMER_REPEAT_MODE_DISABLED = GPTIMER_CTRCTL_REPEAT_REPEAT_0,
    /*! Continues to advance following a zero event */
    DL_TIMER_REPEAT_MODE_ENABLED = GPTIMER_CTRCTL_REPEAT_REPEAT_1,
    /*! Continues to advance following a zero event if the debug mode is not in
     *! effect, or following the release of the debug mode */
    DL_TIMER_REPEAT_MODE_ENABLED_DEBUG = GPTIMER_CTRCTL_REPEAT_REPEAT_3,
} DL_TIMER_REPEAT_MODE;

/*! @enum  DL_TIMER_CC_UPDATE_METHOD */
typedef enum {
    /*! Value written to the CCACT.SWFRCACT register has immediate effect */
    DL_TIMER_CC_UPDATE_METHOD_IMMEDIATE = (GPTIMER_CCCTL_01_CCUPD_IMMEDIATELY),
    /*! Following a zero event. Writes to the CCx_y register are stored in
     *  Shadow register and transferred to CCx_y in the TIMCLK cycle following
     *  CTR equals 0 */
    DL_TIMER_CC_UPDATE_METHOD_ZERO_EVT = (GPTIMER_CCCTL_01_CCUPD_ZERO_EVT),
    /*! Following a compare (down) event. Writes to the CCx_y register are
     *  stored in Shadow register and transferred to CCx_y in the TIMCLK cycle
     *  following CTR equals the CCx_y register value.*/
    DL_TIMER_CC_UPDATE_METHOD_COMP_DN_EVT =
        (GPTIMER_CCCTL_01_CCUPD_COMPARE_DOWN_EVT),
    /*! Following a compare (up) event. Writes to the CCx_y register are stored
     *  in Shadow register and transferred to CCx_y in the TIMCLK cycle
     *  following CTR equals the CCx_y register value. */
    DL_TIMER_CC_UPDATE_METHOD_COMP_UP_EVT =
        (GPTIMER_CCCTL_01_CCUPD_COMPARE_UP_EVT),
    /*! Following a zero or load event. Writes to the CCx_y register are stored
     *  in Shadow register and transferred to CCx_y in the TIMCLK cycle
     *  following CTR equals 0 or CTR. Equals LDn.  Note this update mechanism
     *  is defined for use only in configurations using up/down counting.
     *  This mode is not intended for use in down count configurations */
    DL_TIMER_CC_UPDATE_METHOD_ZERO_OR_LOAD_EVT =
        (GPTIMER_CCCTL_01_CCUPD_ZERO_LOAD_EVT),
    /*! Following a zero event with repeat count also zero.  Writes to the CCx_y
     *  register are stored in Shadow register and transferred to CCx_y in the
     *  TIMCLK cycle following CTR equals 0 and if RC equal 0.*/
    DL_TIMER_CC_UPDATE_METHOD_ZERO_RC_EVT =
        (GPTIMER_CCCTL_01_CCUPD_ZERO_RC_ZERO_EVT),
    /*! Following a TRIG pulse, writes to the
     *! Capture Compare register are stored in shadow register and transferred
     *! to Capture Compare register in the TIMCLK cycle following timer counter
     *! equal to zero AND repeaet counter value is 0 */
    DL_TIMER_CC_UPDATE_METHOD_TRIG_EVT = (GPTIMER_CCCTL_01_CCUPD_TRIG),
} DL_TIMER_CC_UPDATE_METHOD;

/*! @enum  DL_TIMER_CCACT_UPDATE_METHOD */
typedef enum {
    /*! Value written to the CCACT register has immediate effect */
    DL_TIMER_CCACT_UPDATE_METHOD_IMMEDIATE =
        (GPTIMER_CCCTL_01_CCACTUPD_IMMEDIATELY),
    /*! Following a zero event (CTR=0) Writes to the CCACTx_y register
     *  are stored in shadow register and transferred to CCACTx_y in the
     *  TIMCLK cycle following CTR equals 0.  */
    DL_TIMER_CCACT_UPDATE_METHOD_ZERO_EVT =
        (GPTIMER_CCCTL_01_CCACTUPD_ZERO_EVT),
    /*! Following a CCD event (CTR=CC_xy). Writes to the CCACTx_y register
     *  are stored in shadow register and transferred to CCACTx_y in the TIMCLK
     *  cycle following CTR equals the CCx_y register value. */
    DL_TIMER_CCACT_UPDATE_METHOD_COMP_DN_EVT =
        (GPTIMER_CCCTL_01_CCACTUPD_COMPARE_DOWN_EVT),
    /*! Following a CCU event (CTR=CC_xy) Writes to the CCACTx_y register are
     *  stored in shadow register and transferred to CCACTx_y in the TIMCLK
     *  cycle following CTR equals the CCx_y register value. */
    DL_TIMER_CCACT_UPDATE_METHOD_COMP_UP_EVT =
        (GPTIMER_CCCTL_01_CCACTUPD_COMPARE_UP_EVT),
    /*! Following a zero event (CTR=0) or load event (CTR = LOAD) Writes to the
     *  CCACTx_y register are stored in shadow register and transferred to
     *  CCACTx_y in the TIMCLK cycle following CTR equals 0 or CTR. E */
    DL_TIMER_CCACT_UPDATE_METHOD_ZERO_OR_LOAD_EVT =
        (GPTIMER_CCCTL_01_CCACTUPD_ZERO_LOAD_EVT),
    /*! Following a zero event (CTR=0) with repeat count also zero (RC=0).
     *  Writes to the CCACTx_y register are stored in shadow register and
     *  transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0
     *  and if RC equal 0.*/
    DL_TIMER_CCACT_UPDATE_METHOD_ZERO_RC_EVT =
        (GPTIMER_CCCTL_01_CCACTUPD_ZERO_RC_ZERO_EVT),
    /*! On a TRIG pulse, the value stored in CCACT_xy shadow register is loaded
     *  into CCACT_xy register. */
    DL_TIMER_CCACT_UPDATE_METHOD_TRIG_EVT = (GPTIMER_CCCTL_01_CCACTUPD_TRIG),
} DL_TIMER_CCACT_UPDATE_METHOD;

